app/controllers/app_controller.rb

  def locations_create
    @aq.create_location(params[:location])
---
INSERT INTO "locations" ("created_at", "latitude", "longitude", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 01 Oct 2012 01:50:13 UTC +00:00], ["latitude", 37.87422928570097], ["longitude", -122.24208669299315], ["name", "hey"], ["updated_at", Mon, 01 Oct 2012 01:50:13 UTC +00:00]]

  def posts_create
    @aq.create_post(current_user.id, params[:post])
---
INSERT INTO "posts" ("created_at", "location_id", "text", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 03 Oct 2012 18:54:11 UTC +00:00], ["location_id", 1], ["text", "hey"], ["updated_at", Wed, 03 Oct 2012 18:54:11 UTC +00:00], ["user_id", 1]]